# Analyze a small data using Python, documenting the step by step process of data analysis journey

## importing library

In [2]:
# importing pandas library
import pandas as pd

## importing dataset

In [7]:
# uploading dataset
dataset = pd.read_excel (r"C:\Users\USER\Documents\Data set 3mtt1.xlsx")

## displaying dataset

In [8]:
# printing dataset
print (dataset)

      Names  Gender  Age Marital status    State        LGA
0     Amina  Female   25         Single     Kano      Fagge
1     Aisha  Female   23        Married  Katsina     Bakori
2    Khalid    Male   28        Married   Jigawa      Dutse
3      Umar    Male   26         Single   Jigawa     Kiyawa
4    Maryam  Female   27         Single     Kano     Ungogo
5  Abubakar    Male   32        Married     Kano   Kumbotso
6    Zainab  Female   25        Married   Kaduna      Zaria
7    Mansur    Male   29        Married  Plateau  Jos North
8    Mariya  Female   28         Single   Kaduna       Lere

## displaying dataset information

In [11]:
# viewing the dataset
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Names           9 non-null      object
 1   Gender          9 non-null      object
 2   Age             9 non-null      int64
 3   Marital status  9 non-null      object
 4   State           9 non-null      object
 5   LGA             9 non-null      object
dtypes: int64(1), object(5)
memory usage: 564.0+ bytes

In [12]:
# displaying description
dataset.describe()

             Age
count   9.000000
mean   27.000000
std     2.645751
min    23.000000
25%    25.000000
50%    27.000000
75%    28.000000
max    32.000000

## displaying the first and last five elements in dataset

In [13]:
# displaying first five element in dataset
dataset.head()

    Names  Gender  Age Marital status    State     LGA
0   Amina  Female   25         Single     Kano   Fagge
1   Aisha  Female   23        Married  Katsina  Bakori
2  Khalid    Male   28        Married   Jigawa   Dutse
3    Umar    Male   26         Single   Jigawa  Kiyawa
4  Maryam  Female   27         Single     Kano  Ungogo

In [14]:
# displaying last five in dataset
dataset.tail()

      Names  Gender  Age Marital status    State        LGA
4    Maryam  Female   27         Single     Kano     Ungogo
5  Abubakar    Male   32        Married     Kano   Kumbotso
6    Zainab  Female   25        Married   Kaduna      Zaria
7    Mansur    Male   29        Married  Plateau  Jos North
8    Mariya  Female   28         Single   Kaduna       Lere